CRM_для_разработки/src/Enums/РезультатыЗвонка/РезультатыЗвонка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РезультатыЗвонка</name>
  <enumValues>
    <name>Успех</name>
  </enumValues>
  <enumValues>
    <name>ЕстьНовыеЗадачи</name>
  </enumValues>
  <enumValues>
    <name>ИнтересуютСервисыИТС</name>
  </enumValues>
  <enumValues>
    <name>Недозвон</name>
  </enumValues>
  <enumValues>
    <name>НеСостоялось</name>
  </enumValues>
  <enumValues>
    <name>НетЗадач</name>
  </enumValues>
  <enumValues>
    <name>НетДенег</name>
  </enumValues>
  <enumValues>
    <name>НичегоНеИнтересует</name>
  </enumValues>
  <enumValues>
    <name>НеПланируютПродолжатьСотрудничать</name>
  </enumValues>
  <enumValues>
    <name>ПретензииПоРаботе</name>
  </enumValues>
  <enumValues>
    <name>Провал</name>
  </enumValues>
  <enumValues>
    <name>БезИзменений</name>
  </enumValues>
</mdclass:Enum>

CRM_для_разработки/src/Enums/РезультатыЗвонка/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.РезультатыЗвонка.Успех, "Принято положительное решение (Успех)");
	ДанныеВыбора.Добавить(Перечисления.РезультатыЗвонка.БезИзменений);
	ДанныеВыбора.Добавить(Перечисления.РезультатыЗвонка.Недозвон);
	ДанныеВыбора.Добавить(Перечисления.РезультатыЗвонка.НеПланируютПродолжатьСотрудничать);
	ДанныеВыбора.Добавить(Перечисления.РезультатыЗвонка.НеСостоялось);
	ДанныеВыбора.Добавить(Перечисления.РезультатыЗвонка.ПретензииПоРаботе);
	ДанныеВыбора.Добавить(Перечисления.РезультатыЗвонка.Провал, "Отрицательное решение (Провал)");
	
	
КонецПроцедуры
